<a href="https://colab.research.google.com/github/alinapradhan/All-Spark-SQL-functions/blob/main/SPARKSQLAllFunctionsPyspark.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.11/dist-packages (3.5.1)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.11/dist-packages (from pyspark) (0.10.9.7)

In [ ]:
## create sample data
from pyspark.sql import SparkSession
from pyspark.sql.functions import lit
from datetime import datetime

In [ ]:
# intialise spark session
spark = SparkSession.builder.appName("Sample Data").getOrCreate()

In [ ]:
spark

In [ ]:
# sample data
data = [
    (1, "John Doe", "2024-08-01", 23, 1000.50),
    (2, "Jane Smith", "2024-08-02", 25, 1500.75),
    (3, "Bob Johnson", "2024-08-03", 18,3000.10),
    (4, "Alice Brown", "2024-08-04", 22, 2500.25),
    (5, "David Lee", "2024-08-05", 27, 3500.50),
    (6,"Ayush Pradhan","2024-08-06",31,2500.45),
]

In [ ]:
# Create Dataframe
columns = ["id", "name", "dob", "age", "salary"]
df = spark.createDataFrame(data, columns)

In [ ]:
# Spark the intial Dataframe
df.show()

+---+-------------+----------+---+-------+
| id|         name|       dob|age| salary|
+---+-------------+----------+---+-------+
|  1|     John Doe|2024-08-01| 23| 1000.5|
|  2|   Jane Smith|2024-08-02| 25|1500.75|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|
|  4|  Alice Brown|2024-08-04| 22|2500.25|
|  5|    David Lee|2024-08-05| 27| 3500.5|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|
+---+-------------+----------+---+-------+

In [ ]:
# 1 .col  #Selects the "name" column.
from pyspark.sql.functions import col
df.select(col("name")).show()

+-------------+
|         name|
+-------------+
|     John Doe|
|   Jane Smith|
|  Bob Johnson|
|  Alice Brown|
|    David Lee|
|Ayush Pradhan|
+-------------+

In [ ]:
# 2. lit #Adds a new column with a literal valudf_country = df.withColumn("country", lit("USA"))
df_country = df.withColumn("country", lit("USA"))
df_country.show()

+---+-------------+----------+---+-------+-------+
| id|         name|       dob|age| salary|country|
+---+-------------+----------+---+-------+-------+
|  1|     John Doe|2024-08-01| 23| 1000.5|    USA|
|  2|   Jane Smith|2024-08-02| 25|1500.75|    USA|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|    USA|
|  4|  Alice Brown|2024-08-04| 22|2500.25|    USA|
|  5|    David Lee|2024-08-05| 27| 3500.5|    USA|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|    USA|
+---+-------------+----------+---+-------+-------+

In [ ]:
df.show()

+---+-------------+----------+---+-------+
| id|         name|       dob|age| salary|
+---+-------------+----------+---+-------+
|  1|     John Doe|2024-08-01| 23| 1000.5|
|  2|   Jane Smith|2024-08-02| 25|1500.75|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|
|  4|  Alice Brown|2024-08-04| 22|2500.25|
|  5|    David Lee|2024-08-05| 27| 3500.5|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|
+---+-------------+----------+---+-------+

In [ ]:
# 3. adds 5 to the "age" column
from pyspark.sql.functions import expr
df_age = df.withColumn("age_plus_5", expr("age + 5"))
df_age.show()

+---+-------------+----------+---+-------+----------+
| id|         name|       dob|age| salary|age_plus_5|
+---+-------------+----------+---+-------+----------+
|  1|     John Doe|2024-08-01| 23| 1000.5|        28|
|  2|   Jane Smith|2024-08-02| 25|1500.75|        30|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|        23|
|  4|  Alice Brown|2024-08-04| 22|2500.25|        27|
|  5|    David Lee|2024-08-05| 27| 3500.5|        32|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|        36|
+---+-------------+----------+---+-------+----------+

In [ ]:
# 4. when
#Classifies people as "Adult" or "Minor".
#from pyspark.sql.functions import when
#df.withColumn("status", when(col("age") > 18, "Adult").otherwise("Minor")).show()
from pyspark.sql.functions import when
df_classification = df.withColumn("classification", when(col("age") >= 18, "Adult").otherwise("Minor"))
df_classification.show()

+---+-------------+----------+---+-------+--------------+
| id|         name|       dob|age| salary|classification|
+---+-------------+----------+---+-------+--------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|         Adult|
|  2|   Jane Smith|2024-08-02| 25|1500.75|         Adult|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|         Adult|
|  4|  Alice Brown|2024-08-04| 22|2500.25|         Adult|
|  5|    David Lee|2024-08-05| 27| 3500.5|         Adult|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|         Adult|
+---+-------------+----------+---+-------+--------------+

In [ ]:
#5 .concat
#Concatenates first and last names with a space.
from pyspark.sql.functions import concat
df_concat = df.withColumn("full_name", concat(col("name"), lit(" ")))
df_concat.show()

+---+-------------+----------+---+-------+--------------+
| id|         name|       dob|age| salary|     full_name|
+---+-------------+----------+---+-------+--------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|     John Doe |
|  2|   Jane Smith|2024-08-02| 25|1500.75|   Jane Smith |
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|  Bob Johnson |
|  4|  Alice Brown|2024-08-04| 22|2500.25|  Alice Brown |
|  5|    David Lee|2024-08-05| 27| 3500.5|    David Lee |
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|Ayush Pradhan |
+---+-------------+----------+---+-------+--------------+

In [ ]:
# 6 . substring
#Extracts the first three characters from the "name" column.
from pyspark.sql.functions import substring
df_substring = df.withColumn("first_three_chars", substring(col("name"), 1, 3))
df_substring.show()

+---+-------------+----------+---+-------+-----------------+
| id|         name|       dob|age| salary|first_three_chars|
+---+-------------+----------+---+-------+-----------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|              Joh|
|  2|   Jane Smith|2024-08-02| 25|1500.75|              Jan|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|              Bob|
|  4|  Alice Brown|2024-08-04| 22|2500.25|              Ali|
|  5|    David Lee|2024-08-05| 27| 3500.5|              Dav|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|              Ayu|
+---+-------------+----------+---+-------+-----------------+

In [ ]:
# 7 . split
## splits the name column into AN ARRAY of words
from pyspark.sql.functions import split
df_split = df.withColumn("name_array", split(col("name"), " "))
df_split.show()

+---+-------------+----------+---+-------+----------------+
| id|         name|       dob|age| salary|      name_array|
+---+-------------+----------+---+-------+----------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|     [John, Doe]|
|  2|   Jane Smith|2024-08-02| 25|1500.75|   [Jane, Smith]|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|  [Bob, Johnson]|
|  4|  Alice Brown|2024-08-04| 22|2500.25|  [Alice, Brown]|
|  5|    David Lee|2024-08-05| 27| 3500.5|    [David, Lee]|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|[Ayush, Pradhan]|
+---+-------------+----------+---+-------+----------------+

In [ ]:
# 8 . regexp_replace
# replaces "john" with "Jon" in the "name" column
from pyspark.sql.functions import regexp_replace
df_replace = df.withColumn("replaced_name", regexp_replace(col("name"), "John", "Jon"))
df_replace.show()

+---+-------------+----------+---+-------+-------------+
| id|         name|       dob|age| salary|replaced_name|
+---+-------------+----------+---+-------+-------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|      Jon Doe|
|  2|   Jane Smith|2024-08-02| 25|1500.75|   Jane Smith|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|   Bob Jonson|
|  4|  Alice Brown|2024-08-04| 22|2500.25|  Alice Brown|
|  5|    David Lee|2024-08-05| 27| 3500.5|    David Lee|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|Ayush Pradhan|
+---+-------------+----------+---+-------+-------------+

In [ ]:
# 9. count
# Counts the number of records in the DataFrame
from pyspark.sql.functions import count
df_count = df.select(count("*").alias("record_count"))
df_count.show()

+------------+
|record_count|
+------------+
|           6|
+------------+

In [ ]:
# 10. sum
#Calculates the total salary.
from pyspark.sql.functions import sum
df_sum = df.agg(sum("salary").alias("total_salary"))
df_sum.show()

+------------------+
|      total_salary|
+------------------+
|14002.550000000001|
+------------------+

In [ ]:
# 11 .avg
#Calculates the average age.
from pyspark.sql.functions import avg
df_avg = df.agg(avg("age").alias("average_age"))
df_avg.show()

+------------------+
|       average_age|
+------------------+
|24.333333333333332|
+------------------+

In [ ]:
# 12 max
# finds the maximum salary
from pyspark.sql.functions import max
df_max = df.agg(max("salary").alias("max_salary"))
df_max.show()

+----------+
|max_salary|
+----------+
|    3500.5|
+----------+

In [ ]:
# 13 min
# finds the minimum age
from pyspark.sql.functions import min
df_min = df.agg(min("age").alias("min_age"))
df_min.show()

+-------+
|min_age|
+-------+
|     18|
+-------+

In [ ]:
# 14 round
# rounds the salary to the nearest integer
from pyspark.sql.functions import round
df_round = df.withColumn("rounded_salary", round(col("salary"), 0))
df_round.show()

+---+-------------+----------+---+-------+--------------+
| id|         name|       dob|age| salary|rounded_salary|
+---+-------------+----------+---+-------+--------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|        1001.0|
|  2|   Jane Smith|2024-08-02| 25|1500.75|        1501.0|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|        3000.0|
|  4|  Alice Brown|2024-08-04| 22|2500.25|        2500.0|
|  5|    David Lee|2024-08-05| 27| 3500.5|        3501.0|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|        2500.0|
+---+-------------+----------+---+-------+--------------+

In [ ]:
# 15. data_format
# Formats the "dob ( date of birth )" columns as MM/dd/YY
from pyspark.sql.functions import date_format
df_format = df.withColumn("formatted_dob", date_format(col("dob"), "mm/dd/yyyy"))
df_format.show()

+---+-------------+----------+---+-------+-------------+
| id|         name|       dob|age| salary|formatted_dob|
+---+-------------+----------+---+-------+-------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|   00/01/2024|
|  2|   Jane Smith|2024-08-02| 25|1500.75|   00/02/2024|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|   00/03/2024|
|  4|  Alice Brown|2024-08-04| 22|2500.25|   00/04/2024|
|  5|    David Lee|2024-08-05| 27| 3500.5|   00/05/2024|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|   00/06/2024|
+---+-------------+----------+---+-------+-------------+

In [ ]:
# 16 current date
# adds the current date to the DatAfrAME
from pyspark.sql.functions import current_date
df_current_date = df.withColumn("current_date", current_date())
df_current_date.show()

+---+-------------+----------+---+-------+------------+
| id|         name|       dob|age| salary|current_date|
+---+-------------+----------+---+-------+------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|  2025-08-02|
|  2|   Jane Smith|2024-08-02| 25|1500.75|  2025-08-02|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|  2025-08-02|
|  4|  Alice Brown|2024-08-04| 22|2500.25|  2025-08-02|
|  5|    David Lee|2024-08-05| 27| 3500.5|  2025-08-02|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|  2025-08-02|
+---+-------------+----------+---+-------+------------+

In [ ]:
# 17 CURRENT TIMESTAMP
#adds the current timestamp to the DataFrame
from pyspark.sql.functions import current_timestamp
df_current_timestamp = df.withColumn("current_timestamp", current_timestamp())
df_current_timestamp.show()

+---+-------------+----------+---+-------+--------------------+
| id|         name|       dob|age| salary|   current_timestamp|
+---+-------------+----------+---+-------+--------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|2025-08-02 10:22:...|
|  2|   Jane Smith|2024-08-02| 25|1500.75|2025-08-02 10:22:...|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|2025-08-02 10:22:...|
|  4|  Alice Brown|2024-08-04| 22|2500.25|2025-08-02 10:22:...|
|  5|    David Lee|2024-08-05| 27| 3500.5|2025-08-02 10:22:...|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|2025-08-02 10:22:...|
+---+-------------+----------+---+-------+--------------------+

In [ ]:
# 18 year,month,dayofmonth
# Extracts the year,month, and the day from the "dob" column
from pyspark.sql.functions import year, month, dayofmonth

In [ ]:
df_year = df.withColumn("year", year(col("dob")))
df_year.show()

+---+-------------+----------+---+-------+----+
| id|         name|       dob|age| salary|year|
+---+-------------+----------+---+-------+----+
|  1|     John Doe|2024-08-01| 23| 1000.5|2024|
|  2|   Jane Smith|2024-08-02| 25|1500.75|2024|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|2024|
|  4|  Alice Brown|2024-08-04| 22|2500.25|2024|
|  5|    David Lee|2024-08-05| 27| 3500.5|2024|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|2024|
+---+-------------+----------+---+-------+----+

In [ ]:
#19 date_add
#adds 10 days top the "dob" columns
from pyspark.sql.functions import date_add
df_date_add = df.withColumn("date_after_10_days", date_add(col("dob"), 10))
df_date_add.show()

+---+-------------+----------+---+-------+------------------+
| id|         name|       dob|age| salary|date_after_10_days|
+---+-------------+----------+---+-------+------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|        2024-08-11|
|  2|   Jane Smith|2024-08-02| 25|1500.75|        2024-08-12|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|        2024-08-13|
|  4|  Alice Brown|2024-08-04| 22|2500.25|        2024-08-14|
|  5|    David Lee|2024-08-05| 27| 3500.5|        2024-08-15|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|        2024-08-16|
+---+-------------+----------+---+-------+------------------+

In [ ]:
# 20 date_sub
# subtracts 10 days from the "dob" columns
from pyspark.sql.functions import date_sub
df_date_sub = df.withColumn("date_before_10_days", date_sub(col("dob"), 10))
df_date_sub.show()

+---+-------------+----------+---+-------+-------------------+
| id|         name|       dob|age| salary|date_before_10_days|
+---+-------------+----------+---+-------+-------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|         2024-07-22|
|  2|   Jane Smith|2024-08-02| 25|1500.75|         2024-07-23|
|  3|  Bob Johnson|2024-08-03| 18| 3000.1|         2024-07-24|
|  4|  Alice Brown|2024-08-04| 22|2500.25|         2024-07-25|
|  5|    David Lee|2024-08-05| 27| 3500.5|         2024-07-26|
|  6|Ayush Pradhan|2024-08-06| 31|2500.45|         2024-07-27|
+---+-------------+----------+---+-------+-------------------+